zahidul3/athan-clock/BOOSTXL-K350QVG-S1_GrlibExample_MSP432P401R/main.c
    if(status & EUSCI_A_UART_TRANSMIT_INTERRUPT)
    {
        printDebugString("TX\n\r");
        GPIO_setOutputLowOnPin(CC_INT_PORT, CC_INT_PIN);
    }
}

void initUART(void)
{
    /* Selecting P3.2/PM_UCA2RXD/PM_UCA2SOMI and P3.3/PM_UCA2TXD/PM_UCA2SIMO in UART mode */
    MAP_GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P3,
            GPIO_PIN2 | GPIO_PIN3, GPIO_PRIMARY_MODULE_FUNCTION);

    //![Simple UART Example]
    /* Configuring UART Module */
    MAP_UART_initModule(EUSCI_A2_BASE, &uartConfig);

    /* Enable UART module */
    MAP_UART_enableModule(EUSCI_A2_BASE);

    /* Enabling interrupts */
    MAP_UART_enableInterrupt(EUSCI_A2_BASE, EUSCI_A_UART_RECEIVE_INTERRUPT | EUSCI_A_UART_TRANSMIT_INTERRUPT);
    MAP_Interrupt_enableInterrupt(INT_EUSCIA2);
    GPIO_setOutputLowOnPin(CC_INT_PORT, CC_INT_PIN);
}


void SendUARTCmd(char ch)
{
    GPIO_setOutputHighOnPin(CC_INT_PORT, CC_INT_PIN);
    MAP_UART_transmitData(EUSCI_A2_BASE, ch);
}

void buttonIntHandler(void)
{
    GPIO_clearInterruptFlag(BUTTON1_PORT, BUTTON1_PIN);

    printDebugString("Button Pressed!\n\r");

    SendUARTCmd('I');
}

uint32_t sysTickCount = 0;
/*
 * SysTick interrupt handler. This handler toggles HEARTBEAT LED on/off.
 */
void SysTick_Handler(void)
{
    sysTickCount++;
    GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);
}

uint16_t xSum, ySum;
uint16_t athanThreshold[6]= {4000, 5200, 6700, 8200, 9700, 17000};
const char* const arr[] = { "Fajr", "Sunrise", "Dhuhr", "Asr", "Maghrib", "Isha", 0 }; // all const

void polling_delay_ms(uint16_t millis)
{
    uint32_t i,j = 0;
    uint32_t time = 120000;

    //for(j = 0; j < millis; j++)
    {
        for(i = 0; i < (time*millis); i++)
        {
            ;
        }
    }
}

void main(void)
{
    int16_t ulIdx;
    WDT_A_hold(__WDT_A_BASE__);
    MAP_Interrupt_disableMaster();

    /* Initialize the demo. */
    boardInit();
    clockInit();
    initializeDemoButtons();

    polling_delay_ms(64);
    //
    // Configure the pins that connect to the LCD as GPIO outputs.
    //
    GPIO_setAsOutputPin(CC_INT_PORT, CC_INT_PIN);
    GPIO_setOutputLowOnPin(CC_INT_PORT, CC_INT_PIN);

    GPIO_setAsOutputPin(HEARTBEAT_PORT, HEARTBEAT_PIN);
    GPIO_setOutputLowOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);

    GPIO_toggleOutputOnPin(HEARTBEAT_PORT, HEARTBEAT_PIN);

    //setup S1 Left Button GPIO
    GPIO_setAsInputPinWithPullUpResistor(BUTTON1_PORT, BUTTON1_PIN);
    MAP_GPIO_clearInterruptFlag(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_interruptEdgeSelect(BUTTON1_PORT, BUTTON1_PIN, GPIO_HIGH_TO_LOW_TRANSITION);
    GPIO_registerInterrupt(BUTTON1_PORT, buttonIntHandler);
    GPIO_enableInterrupt(BUTTON1_PORT, BUTTON1_PIN);

    MAP_SysTick_setPeriod(12000000);
    MAP_SysTick_enableModule();

    initUART();         //9600baud 8N1
    initUART0Debug();   //921600baud 8N1

    //MAP_Interrupt_enableSleepOnIsrExit();

    /* Globally enable interrupts. */
    MAP_Interrupt_enableMaster();
    MAP_SysTick_enableInterrupt();

    // LCD setup using Graphics Library API calls
    Kitronix320x240x16_SSD2119Init();
    Graphics_initContext(&g_sContext, &g_sKitronix320x240x16_SSD2119);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_BLACK);
    Graphics_setFont(&g_sContext, &g_sFontCmss36b);
    Graphics_clearDisplay(&g_sContext);

    touch_initInterface();

    drawMainMenu();

    printDebugString("Hello World!\n\r");
/*
    while(1)
    {
        MAP_PCM_gotoLPM0();
    }
*/

    // Loop to detect touch
    while(1)
    {
        /* Wait for a touch to be detected and wait ~4ms. */
        while(!touch_detectedTouch())
        {
            ;
        }
        touch_delay();

        /* Sample the X and Y measurements of the touch screen. */
        xSum = touch_sampleX();
        ySum = touch_sampleY();

        if(xSum > 1024)
        {
            memset(bufferTouch, 0, DEBUG_BUFFER_SIZE);
            ltoa(xSum, bufferTouch);
            uint8_t strLen = strlen(bufferTouch);
            bufferTouch[strLen] = '\n';
            bufferTouch[strLen+1] = '\r';
            bufferTouch[strLen+2] = 0;
            //ltoa(ySum,(bufferTouch+strLen+1));
            //printDebugString("Touched: ");
            printDebugString(bufferTouch);

            for(ulIdx=0; ulIdx<6; ulIdx++)
            {
                if(xSum <= athanThreshold[ulIdx])
                {
                    printDebugInt(ulIdx);
                    printDebugString(arr[ulIdx]);
                    if(athanDescColor[ulIdx] == GRAPHICS_COLOR_GREEN)
                    {
                        athanDescColor[ulIdx] = GRAPHICS_COLOR_GRAY;
                    }
                    else
                    {
                        athanDescColor[ulIdx] = GRAPHICS_COLOR_GREEN;
                    }
                    drawMainMenu();
                    break;
                }
            }
        }

        while(touch_detectedTouch())
        {
            ;
        }
        //printDebugString("\n\r");

        //SendUARTCmd('A');
        //touch_updateCurrentTouch(&g_sTouchContext);

//        if(g_ranDemo == true)
//        {
//            g_ranDemo = false;
//            drawMainMenu();
//        }

//        if( g_sTouchContext.touch)
//        {
//            if(Graphics_isImageButtonSelected(&primitiveButton, g_sTouchContext.x,  g_sTouchContext.y)){
//                Graphics_drawSelectedImageButton(&g_sContext,&primitiveButton);
//                runPrimitivesDemo();
//            }else if (Graphics_isImageButtonSelected(&imageButton, g_sTouchContext.x,  g_sTouchContext.y)){
//                Graphics_drawSelectedImageButton(&g_sContext,&imageButton);
//                runImagesDemo();
//            }
//
//            if(g_ranDemo == true)
//            {
//                g_ranDemo = false;
//                drawMainMenu();
//            }
//        }
    }

}

void initializeDemoButtons(void)
{
    // Initiliaze primitives Demo Button
    primitiveButton.xPosition=20;
    primitiveButton.yPosition=50;
    primitiveButton.borderWidth=5;
    primitiveButton.selected=false;
    primitiveButton.imageWidth=Primitives_Button4BPP_UNCOMP.xSize;
    primitiveButton.imageHeight=Primitives_Button4BPP_UNCOMP.ySize;
    primitiveButton.borderColor=GRAPHICS_COLOR_WHITE;
    primitiveButton.selectedColor=GRAPHICS_COLOR_RED;
    primitiveButton.image=&Primitives_Button4BPP_UNCOMP;


    // Initiliaze images Demo Button
    imageButton.xPosition=180;
    imageButton.yPosition=50;
    imageButton.borderWidth=5;
    imageButton.selected=false;
    imageButton.imageWidth=Primitives_Button4BPP_UNCOMP.xSize;
    imageButton.imageHeight=Primitives_Button4BPP_UNCOMP.ySize;
    imageButton.borderColor=GRAPHICS_COLOR_WHITE;
    imageButton.selectedColor=GRAPHICS_COLOR_RED;
    imageButton.image=&Images_Button4BPP_UNCOMP;

